Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
s_layer.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.python_libraries_layer.data.aws_partition.current: Reading...
module.sbeacon.module.python_libraries_layer.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-getResultsURL.data.external.built[0]: Reading...
module.svep[0].module.python_modules_layer.null_resource.archive[0]: Refreshing state... [id=4238399508825140012]
module.svep[0].aws_s3_bucket_cors_configuration.svep-results-cors: Refreshing state... [id=svep-backend-results-20250524134904695300000003]
module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role.lambda[0]: Refreshing state... [id=sbeacon-backend-generateCohortVCfs]
module.security.data.aws_iam_policy_document.lambda-sendSecurityAlert: Reading...
module.security.data.aws_iam_policy_document.lambda-sendSecurityAlert: Read complete after 0s [id=3304041542]
module.svep[0].module.lambda-getResultsURL.data.external.built[0]: Read complete after 0s [id=-]
module.sbeacon.aws_s3_bucket_ownership_controls.dataportal_bucket_ownership_controls: Refreshing state... [id=gasi-dataportal-20250524134911180600000001]
module.sbeacon.aws_s3_bucket_lifecycle_configuration.staging_bucket_lifecycle: Refreshing state... [id=gasi-dataportal-20250524134911180600000001]
module.sbeacon.aws_s3_bucket_cors_configuration.dataportal-bucket: Refreshing state... [id=gasi-dataportal-20250524134911180600000001]
module.sbeacon.data.aws_iam_policy_document.dataportal-locks-access: Reading...
module.sbeacon.data.aws_iam_policy_document.dataportal-locks-access: Read complete after 0s [id=2954399728]
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Refreshing state... [id=6636121337033835387]
module.sbeacon.aws_s3_bucket_ownership_controls.variants_bucket_ownership_controls: Refreshing state... [id=gasi-variants-20250524134911622400000003]
module.sbeacon.aws_s3_bucket_lifecycle_configuration.variants_bucket_lifecycle: Refreshing state... [id=gasi-variants-20250524134911622400000003]
module.sbeacon.aws_api_gateway_resource.biosamples: Refreshing state... [id=yhw4hz]
module.sbeacon.aws_api_gateway_resource.datasets: Refreshing state... [id=7qllhx]
module.sbeacon.aws_api_gateway_resource.g_variants: Refreshing state... [id=xadyn3]
module.sbeacon.aws_api_gateway_resource.info: Refreshing state... [id=sjzxnk]
module.sbeacon.aws_api_gateway_resource.runs: Refreshing state... [id=6nxeg0]
module.sbeacon.aws_api_gateway_resource.entry_types: Refreshing state... [id=xx70sd]
module.sbeacon.data.aws_iam_policy_document.lambda-generateReports: Reading...
module.sbeacon.aws_api_gateway_resource.filtering_terms: Refreshing state... [id=q86gdu]
module.sbeacon.aws_api_gateway_resource.dportal: Refreshing state... [id=wfflrs]
module.sbeacon.data.aws_iam_policy_document.lambda-generateReports: Read complete after 0s [id=722894329]
module.sbeacon.aws_api_gateway_resource.analyses: Refreshing state... [id=ix2myj]
module.sbeacon.aws_api_gateway_resource.configuration: Refreshing state... [id=zceely]
module.sbeacon.aws_api_gateway_resource.map: Refreshing state... [id=2bkfl5]
module.sbeacon.aws_api_gateway_resource.projects: Refreshing state... [id=oi9qkt]
module.sbeacon.aws_api_gateway_resource.admin: Refreshing state... [id=4c88gk]
module.sbeacon.aws_api_gateway_resource.individuals: Refreshing state... [id=tszbth]
module.sbeacon.module.lambda-getDatasets.null_resource.archive[0]: Refreshing state... [id=5400887986655516193]
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Refreshing state... [id=7890531584381881950]
module.sbeacon.aws_s3_bucket_ownership_controls.lambda_layers_bucket_ownership_controls: Refreshing state... [id=gasi-lambda-layers-20250524134911333700000002]
module.sbeacon.data.aws_iam_policy_document.extra-glue-policy-document: Reading...
module.sbeacon.data.aws_iam_policy_document.extra-glue-policy-document: Read complete after 0s [id=2379673200]
module.sbeacon.aws_s3_bucket_lifecycle_configuration.metadata_bucket_lifecycle: Refreshing state... [id=gasi-metadata-20250524134912137300000004]
module.sbeacon.aws_s3_bucket_cors_configuration.metadata-bucket: Refreshing state... [id=gasi-metadata-20250524134912137300000004]
module.svep[0].module.lambda-concat.data.external.built[0]: Reading...
module.sbeacon.aws_s3_bucket_ownership_controls.metadata_bucket_ownership_controls: Refreshing state... [id=gasi-metadata-20250524134912137300000004]
module.svep[0].module.lambda-sendJobEmail.data.external.built[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.external.built[0]: Reading...
module.svep[0].module.lambda-pluginGnomad.data.external.built[0]: Reading...
module.svep[0].module.lambda-concatPages.data.external.built[0]: Reading...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Refreshing state... [id=7653845808023187230]
module.svep[0].module.lambda-queryVCFsubmit.data.external.built[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.external.built[0]: Read complete after 1s [id=-]
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Refreshing state... [id=1108224969743167415]
module.svep[0].module.lambda-queryGTF.data.external.built[0]: Reading...
module.svep[0].module.lambda-sendJobEmail.data.external.built[0]: Read complete after 1s [id=-]
module.svep[0].module.lambda-pluginClinvar.data.external.built[0]: Reading...
module.svep[0].module.lambda-pluginGnomad.data.external.built[0]: Read complete after 1s [id=-]
module.svep[0].module.lambda-formatOutput.data.external.built[0]: Reading...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Refreshing state... [id=1770958005152203071]
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Refreshing state... [id=37340997445709411]
module.svep[0].module.lambda-concat.data.external.built[0]: Read complete after 1s [id=-]
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Refreshing state... [id=4525618782582193128]
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Refreshing state... [id=5535288338649526125]
module.svep[0].module.lambda-initQuery.data.external.built[0]: Reading...
module.svep[0].module.lambda-concatPages.data.external.built[0]: Read complete after 1s [id=-]
module.svep[0].module.lambda-queryVCFsubmit.data.external.built[0]: Read complete after 1s [id=-]
module.sbeacon.module.lambda-generateReports.null_resource.archive[0]: Refreshing state... [id=2200174777819701770]
module.svep[0].module.lambda-createPages.data.external.built[0]: Reading...
module.svep[0].module.lambda-queryVCF.data.external.built[0]: Reading...
module.sbeacon.module.lambda-data-portal.null_resource.archive[0]: Refreshing state... [id=8592355148136183697]
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Refreshing state... [id=1494753229486315577]
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Refreshing state... [id=8413213257564994929]
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Refreshing state... [id=1377085623762498011]
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Refreshing state... [id=2001617435335264242]
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Refreshing state... [id=4290755353513224909]
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Refreshing state... [id=586476708435466528]
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Refreshing state... [id=8685112057219128528]
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Refreshing state... [id=3418026463941140065]
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Refreshing state... [id=8806060576555951764]
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Refreshing state... [id=6069520936253606442]
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Refreshing state... [id=8535974815800217000]
module.sbeacon.module.python_modules_layer.null_resource.archive[0]: Refreshing state... [id=1307878794300672237]
module.sbeacon.module.lambda-admin.null_resource.archive[0]: Refreshing state... [id=3815800087514708859]
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Refreshing state... [id=1638418873688405585]
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Refreshing state... [id=2242050360670407875]
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Refreshing state... [id=7918160946902537104]
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Refreshing state... [id=878389027320942751]
module.cognito.module.lambda-sendSvepJobEmail.null_resource.archive[0]: Refreshing state... [id=7182026050633295345]
module.svep[0].module.lambda-formatOutput.data.external.built[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-queryGTF.data.external.built[0]: Read complete after 0s [id=-]
module.svep[0].aws_api_gateway_method.vcfstats-options: Refreshing state... [id=agm-49hervuih0-g3m5jp-OPTIONS]
module.svep[0].module.docker_image_qcFigures_lambda.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=svep-qcfigures-lambda-containers]
module.svep[0].aws_api_gateway_method.results-options: Refreshing state... [id=agm-49hervuih0-dkhqay-OPTIONS]
module.svep[0].module.lambda-initQuery.data.external.built[0]: Read complete after 1s [id=-]
module.svep[0].aws_api_gateway_method.submit-options: Refreshing state... [id=agm-49hervuih0-ww21x7-OPTIONS]
module.sbeacon.module.python_libraries_layer.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-pluginClinvar.data.external.built[0]: Read complete after 1s [id=-]
module.svep[0].module.lambda-queryVCF.data.external.built[0]: Read complete after 1s [id=-]
module.sbeacon.aws_s3_bucket_acl.dataportal_bucket_acl: Refreshing state... [id=gasi-dataportal-20250524134911180600000001,private]
module.svep[0].aws_iam_instance_profile.ec2_references_instance_profile: Refreshing state... [id=svep_backend_ec2_references_instance_profile]
module.sbeacon.aws_api_gateway_resource.biosamples-filtering_terms: Refreshing state... [id=p8fp4p]
module.sbeacon.aws_api_gateway_resource.biosamples-id: Refreshing state... [id=cj0t4v]
module.svep[0].module.lambda-createPages.data.external.built[0]: Read complete after 1s [id=-]
module.sbeacon.aws_s3_bucket_acl.variants_bucket_acl: Refreshing state... [id=gasi-variants-20250524134911622400000003,private]
module.sbeacon.aws_api_gateway_resource.g_variants-id: Refreshing state... [id=4k5xwj]
module.sbeacon.aws_api_gateway_resource.datasets-filtering_terms: Refreshing state... [id=gwxbpd]
module.sbeacon.aws_api_gateway_resource.datasets-id: Refreshing state... [id=988914]
module.sbeacon.aws_api_gateway_resource.analyses-id: Refreshing state... [id=m5i90n]
module.sbeacon.aws_api_gateway_resource.analyses-filtering_terms: Refreshing state... [id=eylaw8]
module.sbeacon.aws_api_gateway_resource.runs-id: Refreshing state... [id=fps4t7]
module.sbeacon.aws_api_gateway_resource.runs-filtering_terms: Refreshing state... [id=k5ywtx]
module.sbeacon.aws_api_gateway_resource.dportal_proxy: Refreshing state... [id=jsr0cp]
module.sbeacon.aws_api_gateway_resource.admin_proxy: Refreshing state... [id=yrayho]
module.sbeacon.aws_api_gateway_method.projects: Refreshing state... [id=agm-sse4jppfz8-oi9qkt-GET]
module.sbeacon.aws_api_gateway_resource.individuals-filtering_terms: Refreshing state... [id=2jwps9]
module.sbeacon.aws_api_gateway_resource.individuals-id: Refreshing state... [id=2jfdqa]
module.sbeacon.aws_s3_bucket_acl.lambda-layers: Refreshing state... [id=gasi-lambda-layers-20250524134911333700000002,private]
module.sbeacon.aws_s3_bucket_acl.metadata: Refreshing state... [id=gasi-metadata-20250524134912137300000004,private]
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=657000114]
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4179320484]
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-qcFigures.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1635098275]
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3755487924]
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2976610245]
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-qcFigures.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=62361993]
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=269662083]
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2382463831]
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3949247289]
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2484114338]
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0]: Refreshing state... [id=builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip]
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1764633960]
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3858596192]
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=903039367]
module.svep[0].aws_api_gateway_integration.vcfstats-options: Refreshing state... [id=agi-49hervuih0-g3m5jp-OPTIONS]
module.svep[0].aws_api_gateway_method_response.vcfstats-options: Refreshing state... [id=agmr-49hervuih0-g3m5jp-OPTIONS-200]
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1882988668]
module.svep[0].aws_api_gateway_integration.submit-options: Refreshing state... [id=agi-49hervuih0-ww21x7-OPTIONS]
module.svep[0].aws_api_gateway_integration.results-options: Refreshing state... [id=agi-49hervuih0-dkhqay-OPTIONS]
module.svep[0].aws_api_gateway_method_response.submit-options: Refreshing state... [id=agmr-49hervuih0-ww21x7-OPTIONS-200]
module.svep[0].aws_api_gateway_method_response.results-options: Refreshing state... [id=agmr-49hervuih0-dkhqay-OPTIONS-200]
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_iam_policy_document.logs[0]: Reading...
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2622388694]
module.svep[0].data.aws_iam_policy_document.lambda-qcFigures: Reading...
module.sbeacon.module.cors-biosamples.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-yhw4hz-OPTIONS]
module.sbeacon.module.cors-info.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-sjzxnk-OPTIONS]
module.sbeacon.module.cors-datasets.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-7qllhx-OPTIONS]
module.sbeacon.aws_api_gateway_resource.biosamples-id-analyses: Refreshing state... [id=5z5zup]
module.svep[0].data.aws_iam_policy_document.lambda-qcFigures: Read complete after 0s [id=2598299901]
module.sbeacon.module.cors-g_variants.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-xadyn3-OPTIONS]
module.sbeacon.aws_api_gateway_resource.biosamples-id-runs: Refreshing state... [id=0omln3]
module.sbeacon.aws_api_gateway_resource.biosamples-id-g_variants: Refreshing state... [id=5pywyj]
module.sbeacon.module.cors-runs.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-6nxeg0-OPTIONS]
module.sbeacon.aws_api_gateway_resource.datasets-id-g_variants: Refreshing state... [id=p0v24v]
module.sbeacon.aws_api_gateway_resource.datasets-id-filtering_terms: Refreshing state... [id=pjr8lx]
module.sbeacon.module.cors-entry_types.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-xx70sd-OPTIONS]
module.sbeacon.aws_api_gateway_resource.datasets-id-individuals: Refreshing state... [id=hbsf0m]
module.sbeacon.aws_api_gateway_resource.datasets-id-biosamples: Refreshing state... [id=gwc4y7]
module.sbeacon.module.cors-filtering_terms.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-q86gdu-OPTIONS]
module.sbeacon.module.cors-analyses.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-ix2myj-OPTIONS]
module.sbeacon.aws_api_gateway_resource.g_variants-id-biosamples: Refreshing state... [id=eu5xf3]
module.sbeacon.aws_api_gateway_resource.g_variants-id-individuals: Refreshing state... [id=ngo9l8]
module.sbeacon.data.archive_file.binaries_layer: Read complete after 8s [id=004bea8184afc6c4c3c5575bdc38ca15c22e9a58]
module.sbeacon.aws_api_gateway_resource.analyses-id-g_variants: Refreshing state... [id=q3gd41]
module.sbeacon.module.cors-map.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-2bkfl5-OPTIONS]
module.sbeacon.aws_api_gateway_resource.runs-id-g_variants: Refreshing state... [id=ih2jru]
module.sbeacon.module.cors-configuration.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-zceely-OPTIONS]
module.sbeacon.aws_api_gateway_resource.runs-id-analyses: Refreshing state... [id=rt4ilc]
module.sbeacon.module.cors-individuals.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-tszbth-OPTIONS]
module.sbeacon.module.cors-projects.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-oi9qkt-OPTIONS]
module.sbeacon.aws_api_gateway_method_response.projects: Refreshing state... [id=agmr-sse4jppfz8-oi9qkt-GET-200]
module.sbeacon.aws_api_gateway_resource.individuals-id-biosamples: Refreshing state... [id=cbna1t]
module.sbeacon.aws_api_gateway_resource.individuals-id-g_variants: Refreshing state... [id=3p7266]
module.svep[0].data.archive_file.binaries_layer: Read complete after 8s [id=ad07bd135908848a0322712f9d5b4da92bdfadce]
module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0]: Refreshing state... [id=builds/8ec362cbcfc12f0b1b16838b7653221f08c7da03e4e64e0434b07cc3700aed80.zip]
module.svep[0].module.lambda-qcFigures.aws_iam_role_policy.logs[0]: Refreshing state... [id=svep-backend-qcFigures:svep-backend-qcFigures-logs]
module.svep[0].module.lambda-formatOutput.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-formatOutput-logs]
module.svep[0].module.lambda-pluginGnomad.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-pluginGnomad-logs]
module.svep[0].aws_api_gateway_integration_response.vcfstats-options: Refreshing state... [id=agir-49hervuih0-g3m5jp-OPTIONS-200]
module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.logs[0]: Refreshing state... [id=sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-logs]
module.svep[0].aws_api_gateway_integration_response.results-options: Refreshing state... [id=agir-49hervuih0-dkhqay-OPTIONS-200]
module.svep[0].aws_api_gateway_integration_response.submit-options: Refreshing state... [id=agir-49hervuih0-ww21x7-OPTIONS-200]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-gwxbpd-OPTIONS]
module.sbeacon.module.cors-biosamples.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-yhw4hz-OPTIONS-200]
module.sbeacon.module.cors-biosamples.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-yhw4hz-OPTIONS]
module.sbeacon.module.cors-biosamples-filtering_terms.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-p8fp4p-OPTIONS]
module.sbeacon.module.cors-biosamples-id.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-cj0t4v-OPTIONS]
module.sbeacon.module.cors-info.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-sjzxnk-OPTIONS-200]
module.sbeacon.module.python_libraries_layer.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.cors-datasets.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-7qllhx-OPTIONS]
module.sbeacon.module.cors-datasets.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-7qllhx-OPTIONS-200]
module.sbeacon.module.cors-info.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-sjzxnk-OPTIONS]
module.sbeacon.module.cors-datasets-id.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-988914-OPTIONS]
module.sbeacon.module.cors-g_variants.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-xadyn3-OPTIONS-200]
module.sbeacon.module.cors-g_variants.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-xadyn3-OPTIONS]
module.sbeacon.module.cors-runs.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-6nxeg0-OPTIONS-200]
module.sbeacon.module.cors-runs.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-6nxeg0-OPTIONS]
module.sbeacon.module.cors-g_variants-id.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-4k5xwj-OPTIONS]
module.sbeacon.module.cors-runs-id.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-fps4t7-OPTIONS]
module.sbeacon.module.cors-entry_types.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-xx70sd-OPTIONS-200]
module.sbeacon.aws_lambda_layer_version.binaries_layer: Refreshing state... [id=arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:2]
module.sbeacon.module.cors-entry_types.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-xx70sd-OPTIONS]
module.sbeacon.module.cors-analyses-id.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-m5i90n-OPTIONS]
module.sbeacon.module.cors-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-q86gdu-OPTIONS-200]
module.sbeacon.module.cors-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-q86gdu-OPTIONS]
module.sbeacon.module.cors-analyses.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-ix2myj-OPTIONS-200]
module.sbeacon.module.cors-analyses.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-ix2myj-OPTIONS]
module.sbeacon.module.cors-map.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-2bkfl5-OPTIONS-200]
module.sbeacon.module.cors-runs-filtering_terms.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-k5ywtx-OPTIONS]
module.sbeacon.module.cors-map.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-2bkfl5-OPTIONS]
module.sbeacon.module.cors-dportal-proxy.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-jsr0cp-OPTIONS]
module.sbeacon.module.cors-analyses-filtering_terms.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-eylaw8-OPTIONS]
module.sbeacon.module.cors-configuration.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-zceely-OPTIONS-200]
module.sbeacon.module.cors-admin-proxy.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-yrayho-OPTIONS]
module.sbeacon.module.cors-configuration.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-zceely-OPTIONS]
module.sbeacon.module.cors-individuals-filtering_terms.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-2jwps9-OPTIONS]
module.sbeacon.module.cors-individuals-id.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-2jfdqa-OPTIONS]
module.sbeacon.module.cors-projects.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-oi9qkt-OPTIONS-200]
module.sbeacon.module.cors-projects.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-oi9qkt-OPTIONS]
module.svep[0].aws_lambda_layer_version.binaries_layer: Refreshing state... [id=arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:2]
module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2]
module.svep[0].module.lambda-formatOutput.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=svep-backend-formatOutput-logs]
module.svep[0].module.lambda-pluginGnomad.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=svep-backend-pluginGnomad-logs]
module.svep[0].module.lambda-qcFigures.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=svep-backend-qcFigures:svep-backend-qcFigures-0]
module.sbeacon.module.cors-individuals.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-tszbth-OPTIONS]
module.sbeacon.module.cors-individuals.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-tszbth-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-cj0t4v-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-cj0t4v-OPTIONS]
module.sbeacon.module.cors-biosamples-id-analyses.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-5z5zup-OPTIONS]
module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0]: Refreshing state... [id=6038b074ae20c6128f703e1e1c4c475000138aa4]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-gwxbpd-OPTIONS]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-gwxbpd-OPTIONS-200]
module.sbeacon.module.cors-biosamples-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-p8fp4p-OPTIONS]
module.sbeacon.module.cors-biosamples-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-p8fp4p-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-runs.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-0omln3-OPTIONS]
module.sbeacon.module.cors-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-xadyn3-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-g_variants.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-p0v24v-OPTIONS]
module.sbeacon.module.cors-datasets-id-individuals.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-hbsf0m-OPTIONS]
module.sbeacon.module.cors-biosamples-id-g_variants.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-5pywyj-OPTIONS]
module.sbeacon.module.cors-g_variants-id.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-4k5xwj-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-4k5xwj-OPTIONS]
module.sbeacon.module.cors-datasets-id-filtering_terms.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-pjr8lx-OPTIONS]
module.sbeacon.module.cors-runs-id.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-fps4t7-OPTIONS-200]
module.sbeacon.module.cors-runs-id.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-fps4t7-OPTIONS]
module.sbeacon.module.cors-entry_types.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-xx70sd-OPTIONS-200]
module.sbeacon.module.cors-datasets-id.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-988914-OPTIONS-200]
module.sbeacon.module.cors-datasets-id.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-988914-OPTIONS]
module.sbeacon.module.cors-datasets-id-biosamples.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-gwc4y7-OPTIONS]
module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-ngo9l8-OPTIONS]
module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-eu5xf3-OPTIONS]
module.sbeacon.module.cors-map.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-2bkfl5-OPTIONS-200]
module.sbeacon.module.cors-analyses-id-g_variants.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-q3gd41-OPTIONS]
module.sbeacon.module.cors-dportal-proxy.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-jsr0cp-OPTIONS-200]
module.sbeacon.module.cors-dportal-proxy.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-jsr0cp-OPTIONS]
module.sbeacon.module.cors-analyses-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-eylaw8-OPTIONS-200]
module.sbeacon.module.cors-analyses-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-eylaw8-OPTIONS]
module.sbeacon.module.cors-admin-proxy.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-yrayho-OPTIONS-200]
module.sbeacon.module.cors-admin-proxy.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-yrayho-OPTIONS]
module.sbeacon.module.cors-runs.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-6nxeg0-OPTIONS-200]
module.sbeacon.module.cors-info.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-sjzxnk-OPTIONS-200]
module.sbeacon.module.cors-runs-id-g_variants.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-ih2jru-OPTIONS]
module.sbeacon.module.cors-individuals-id.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-2jfdqa-OPTIONS]
module.sbeacon.module.cors-individuals-id.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-2jfdqa-OPTIONS-200]
module.sbeacon.module.cors-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-q86gdu-OPTIONS-200]
module.sbeacon.module.cors-analyses.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-ix2myj-OPTIONS-200]
module.sbeacon.module.cors-individuals-id-g_variants.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-3p7266-OPTIONS]
module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2]
module.sbeacon.module.cors-configuration.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-zceely-OPTIONS-200]
module.sbeacon.module.cors-individuals-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-2jwps9-OPTIONS]
module.sbeacon.module.cors-individuals-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-2jwps9-OPTIONS-200]
module.sbeacon.module.cors-datasets.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-7qllhx-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-analyses.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-5z5zup-OPTIONS]
module.sbeacon.module.cors-biosamples-id-analyses.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-5z5zup-OPTIONS-200]
module.sbeacon.module.python_libraries_layer.null_resource.archive[0]: Refreshing state... [id=2144128158186222206]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-gwxbpd-OPTIONS-200]
module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-rt4ilc-OPTIONS]
module.sbeacon.module.cors-biosamples-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-p8fp4p-OPTIONS-200]
module.sbeacon.module.cors-projects.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-oi9qkt-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-g_variants.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-p0v24v-OPTIONS]
module.sbeacon.module.cors-datasets-id-g_variants.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-p0v24v-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-g_variants.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-5pywyj-OPTIONS]
module.sbeacon.module.cors-biosamples-id-g_variants.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-5pywyj-OPTIONS-200]
module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-cbna1t-OPTIONS]
module.sbeacon.module.cors-datasets-id-individuals.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-hbsf0m-OPTIONS]
module.sbeacon.module.cors-datasets-id-individuals.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-hbsf0m-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-4k5xwj-OPTIONS-200]
module.sbeacon.module.cors-runs-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-fps4t7-OPTIONS-200]
module.sbeacon.module.cors-analyses-id.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-m5i90n-OPTIONS]
module.sbeacon.module.cors-analyses-id.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-m5i90n-OPTIONS-200]
module.sbeacon.module.cors-runs-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-k5ywtx-OPTIONS]
module.sbeacon.module.cors-runs-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-k5ywtx-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-biosamples.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-gwc4y7-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-biosamples.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-gwc4y7-OPTIONS]
module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-ngo9l8-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-ngo9l8-OPTIONS]
module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-eu5xf3-OPTIONS]
module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-eu5xf3-OPTIONS-200]
module.sbeacon.module.cors-analyses-id-g_variants.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-q3gd41-OPTIONS-200]
module.sbeacon.module.cors-analyses-id-g_variants.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-q3gd41-OPTIONS]
module.sbeacon.module.cors-analyses-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-eylaw8-OPTIONS-200]
module.sbeacon.module.cors-individuals.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-tszbth-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-runs.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-0omln3-OPTIONS]
module.sbeacon.module.cors-biosamples-id-runs.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-0omln3-OPTIONS-200]
module.sbeacon.module.cors-admin-proxy.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-yrayho-OPTIONS-200]
module.sbeacon.module.cors-biosamples.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-yhw4hz-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-pjr8lx-OPTIONS]
module.sbeacon.module.cors-datasets-id-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-pjr8lx-OPTIONS-200]
module.sbeacon.module.cors-individuals-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-2jwps9-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-analyses.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-5z5zup-OPTIONS-200]
module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-rt4ilc-OPTIONS-200]
module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-rt4ilc-OPTIONS]
module.sbeacon.module.cors-biosamples-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-5pywyj-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-individuals.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-hbsf0m-OPTIONS-200]
module.sbeacon.module.cors-individuals-id-g_variants.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-3p7266-OPTIONS-200]
module.sbeacon.module.cors-individuals-id-g_variants.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-3p7266-OPTIONS]
module.sbeacon.module.cors-analyses-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-m5i90n-OPTIONS-200]
module.sbeacon.module.cors-runs-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-k5ywtx-OPTIONS-200]
module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-cbna1t-OPTIONS]
module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-cbna1t-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-biosamples.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-gwc4y7-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-p0v24v-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-eu5xf3-OPTIONS-200]
module.sbeacon.module.cors-analyses-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-q3gd41-OPTIONS-200]
module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0]: Refreshing state... [id=builds/6a72d23e57319437e8801c89adca98867302212312b12ff46185c7c673e3d0d8.zip]
module.sbeacon.module.cors-biosamples-id-runs.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-0omln3-OPTIONS-200]
module.sbeacon.module.cors-individuals-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-2jfdqa-OPTIONS-200]
module.sbeacon.module.cors-runs-id-g_variants.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-ih2jru-OPTIONS-200]
module.sbeacon.module.cors-runs-id-g_variants.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-ih2jru-OPTIONS]
module.sbeacon.module.cors-datasets-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-988914-OPTIONS-200]
module.sbeacon.module.cors-dportal-proxy.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-jsr0cp-OPTIONS-200]
module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-cbna1t-OPTIONS-200]
module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:2]
module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-rt4ilc-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-cj0t4v-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-ngo9l8-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-pjr8lx-OPTIONS-200]
module.sbeacon.module.cors-individuals-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-3p7266-OPTIONS-200]
module.sbeacon.module.cors-runs-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-ih2jru-OPTIONS-200]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.aws_api_gateway_method.projects has changed
  ~ resource "aws_api_gateway_method" "projects" {
      + authorization_scopes = []
        id                   = "agm-sse4jppfz8-oi9qkt-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.results-options has changed
  ~ resource "aws_api_gateway_integration" "results-options" {
      + cache_key_parameters    = []
        id                      = "agi-49hervuih0-dkhqay-OPTIONS"
      + request_parameters      = {}
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.submit-options has changed
  ~ resource "aws_api_gateway_integration" "submit-options" {
      + cache_key_parameters    = []
        id                      = "agi-49hervuih0-ww21x7-OPTIONS"
      + request_parameters      = {}
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-options has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-options" {
      + cache_key_parameters    = []
        id                      = "agi-49hervuih0-g3m5jp-OPTIONS"
      + request_parameters      = {}
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.results-options has changed
  ~ resource "aws_api_gateway_method" "results-options" {
      + authorization_scopes = []
        id                   = "agm-49hervuih0-dkhqay-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.submit-options has changed
  ~ resource "aws_api_gateway_method" "submit-options" {
      + authorization_scopes = []
        id                   = "agm-49hervuih0-ww21x7-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-options has changed
  ~ resource "aws_api_gateway_method" "vcfstats-options" {
      + authorization_scopes = []
        id                   = "agm-49hervuih0-g3m5jp-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_authenticated will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "gaspi_authenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "gaspi_unauthenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "unauthenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.lambda-sendRegistrationEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendRegistrationEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:127214202110:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:127214202110:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.lambda-sendSvepJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendSvepJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:127214202110:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:127214202110:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "manager_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.ses-sns-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ses-sns-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSESToPublishToSNS"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "127214202110",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cognito.aws_cognito_identity_pool.gaspi_identity_pool will be created
  + resource "aws_cognito_identity_pool" "gaspi_identity_pool" {
      + allow_classic_flow               = false
      + allow_unauthenticated_identities = false
      + arn                              = (known after apply)
      + id                               = (known after apply)
      + identity_pool_name               = "gaspi-users"
      + tags                             = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all                         = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }

      + cognito_identity_providers {
          + client_id               = (known after apply)
          + provider_name           = (known after apply)
          + server_side_token_check = false
        }
    }

  # module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles will be created
  + resource "aws_cognito_identity_pool_roles_attachment" "gaspi_cognito_roles" {
      + id               = (known after apply)
      + identity_pool_id = (known after apply)
      + roles            = (known after apply)

      + role_mapping {
          + ambiguous_role_resolution = "AuthenticatedRole"
          + identity_provider         = (known after apply)
          + type                      = "Token"
        }
    }

  # module.cognito.aws_cognito_user.admin will be created
  + resource "aws_cognito_user" "admin" {
      + attributes            = {
          + "email"          = "admin@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Admin"
          + "given_name"     = "Admin"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "admin@example.com"
    }

  # module.cognito.aws_cognito_user.guest will be created
  + resource "aws_cognito_user" "guest" {
      + attributes            = {
          + "email"          = "guest@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Guest"
          + "given_name"     = "Guest"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "guest@example.com"
    }

  # module.cognito.aws_cognito_user_group.admin_group will be created
  + resource "aws_cognito_user_group" "admin_group" {
      + description  = "Group of users who can has admin privileges"
      + id           = (known after apply)
      + name         = "administrators"
      + precedence   = 1
      + role_arn     = (known after apply)
      + user_pool_id = (known after apply)
    }

  # module.cognito.aws_cognito_user_group.manager_group will be created
  + resource "aws_cognito_user_group" "manager_group" {
      + description  = "Group of users who can has management privileges"
      + id           = (known after apply)
      + name         = "managers"
      + precedence   = 2
      + role_arn     = (known after apply)
      + user_pool_id = (known after apply)
    }

  # module.cognito.aws_cognito_user_in_group.admin_in_admin_group will be created
  + resource "aws_cognito_user_in_group" "admin_in_admin_group" {
      + group_name   = "administrators"
      + id           = (known after apply)
      + user_pool_id = (known after apply)
      + username     = "admin@example.com"
    }

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool will be created
  + resource "aws_cognito_user_pool" "gaspi_user_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OPTIONAL"
      + name                       = "gaspi-users"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all                   = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + user_pool_tier             = (known after apply)

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true
        }

      + email_configuration {
          + configuration_set     = "ses-feedback-config"
          + email_sending_account = "DEVELOPER"
          + from_email_address    = "abdullah.mubarok@undp.org"
          + source_arn            = "arn:aws:ses:ap-southeast-3:127214202110:identity/abdullah.mubarok@undp.org"
        }

      + lambda_config {
          + custom_message       = (known after apply)
          + pre_token_generation = (known after apply)

          + pre_token_generation_config (known after apply)
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + schema {
          + attribute_data_type      = "Boolean"
          + developer_only_attribute = false
          + mutable                  = false
          + name                     = "terraform"
          + required                 = false
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "identity_id"
          + required                 = false

          + string_attribute_constraints {
                # (2 unchanged attributes hidden)
            }
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + software_token_mfa_configuration {
          + enabled = true
        }

      + username_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # module.cognito.aws_cognito_user_pool_client.gaspi_user_pool_client will be created
  + resource "aws_cognito_user_pool_client" "gaspi_user_pool_client" {
      + access_token_validity                         = 5
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = 3
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
        ]
      + id                                            = (known after apply)
      + id_token_validity                             = 5
      + logout_urls                                   = (known after apply)
      + name                                          = "gaspi-users-client"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = 2
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)

      + token_validity_units {
          + access_token  = "minutes"
          + id_token      = "minutes"
          + refresh_token = "hours"
        }
    }

  # module.cognito.aws_iam_policy.admin_group_role_policy will be created
  + resource "aws_iam_policy" "admin_group_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "admin group permissions"
      + id               = (known after apply)
      + name             = "gaspi-admin-group-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/projects/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gasi-dataportal-*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.aws_iam_policy.manager_group_role_policy will be created
  + resource "aws_iam_policy" "manager_group_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "manager group permissions"
      + id               = (known after apply)
      + name             = "gaspi-manager-group-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/projects/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                              
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.